app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?, ?)
---
   def create
  	# ストロングパラメーターを使用
     list = List.new(list_params)
   # DBへ保存する
     list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
   def destroy
   list = List.find(params[:id]) #データ（レコード）を1件取得
   list.destroy #データ（レコード）を削除